{
  "name": "Azucena Milagros Ortiz Castillo",
  "tagline": "Perfect Blend",
  "country": "Peru",
  "style": "Mixed Martial Arts (Striker)",
  "description": "Azucena Milagros Ortiz Castillo, known better as the \"Coffee Queen,\" is beloved for her innocent personality and her fearless fighting style as an MMA champion. The only daughter of the family who owns Ortiz Farm, a coffee plantation located 2000 meters above sea level, Azucena grew up observing her father's trade and dreamed of becoming the world's best coffee farmer. To make her dream come true, a young Azucena conducted countless experiments by cultivating new coffee plants based on her novel ideas. Although adults around her rejected her ideas time and again, Azucena used their rejection to motivate herself and continued to refine her daring spirit. A few years later, Azucena's efforts finally bore fruit, and her coffee beans were awarded the highest quality rating at a world-renowned trade fair, making her a rising star within the industry. Azucena continued to challenge herself using her positive thinking and ingenious ideas to pursue and achieve success both as a model and a dancer. She even studied business administration at the most prestigious university in the country. However, the caffeine coursing through her body led her to the conclusion that, in order to become the best in the world, one needs not only stability, but adventures as well. A plan suddenly clicked into place for her while she captured a runaway alpaca with one hand and held a cup of coffee in the other. She decided she would use her physical prowess earned from training at high attitudes to break into the American MMA scene and promote her eponymous \"Azucena Blend.\" Her plan succeeded, and in her first year, Azucena rose to the top of the ranks as champion. All the while, she acted as a walking billboard for the Ortiz Farm, leading to a dramatic increase in the plantation's sales and popularity. As her next step forward, Azucena has turned her attention to The King of Iron Fist Tournament, which has emerged as the world's most popular fighting tournament in recent years. If she wins, Azucena will be that much closer to becoming best in the world. Although the date for the tournament remains undecided, Azucena is confident that that day is not far away. \"My intuition never fails me!\"",
  "links": {
    "official": "https://tekken.com/fighters/azucena-milagros-ortiz-castillo",
    "wavu": "https://wavu.wiki/t/Azucena",
    "fandom": "https://tekken.fandom.com/wiki/Azucena_Ortiz",
    "discord": "https://discord.gg/qkNe4wNMDH",
    "youtube movelist": "https://www.youtube.com/watch?v=8Ck_axLUak0"
  }
}
