{
  "name": "Shaheen",
  "tagline": "Desert Falcon",
  "country": "Saudi Arabia",
  "style": "Close Quarters Combat",
  "description": [
    "Shaheen is a simple, \"back-to-basics\" character. His game-plan revolves almost entirely around his extremely potent full crouch (FC) mix-up and controlling space through an abundance of great pokes. He has a strong punishment kit, and both a generic df+2 and a hopkick to whiff punish with. He has several strong counterhit tools to dissuade mashing and decent plus frame mids to pressure a defensive opponent.",
    "Shaheen takes great advantage of Tekken 8's grey health and Heat system. He has several good moves that deal chip, while also being blessed with moves that entirely remove grey health. While in Heat, Shaheen's FC mix and grey life manipulation become even more potent, as he is able to repeatedly chip the opponent down while threatening with slide, launching mids, or his new guard break move Al-Ghul Master (you can read more about it on his Tech page.) While outside of Heat, however, his wall game is considerably weakened, and he has some of the lowest wall-combo damage in the game.",
    "Being so straightforward is a both a blessing and a curse, as taking advantage of his straightforward kit demands strong fundamentals and decision making."
  ],
  "strengths": [
    "Powerful full crouch mixup: Slide (FC.df,d,df+3) is arguably the best low in the entire game, and can be VERY difficult deal with if done correctly.",
    "Consistency is Key: Shaheen's gameplan is very simple, his moves are intuitive, and he has great block and whiff punishment tools.",
    "Heat Wall Pressure: Al-Ghul Master into f+2,3 along with f,f,F+2 and df+3 can turn Shaheen into a menace at the wall while he's in Heat.",
    "Grey Health Deletion: Has the rare ability to erase opponent's grey health with easy setups.",
    "Combo Artist: Has very lenient and varied combo routes that allow for good damage, wall carry, or decent okizeme. Also has the ability to easily switch sides during combos, giving him great control over stage positioning.",
    "Agile: Great movement and approach tools.",
    "Solid Counter-hit Tools: Has reliable CH tools in a game where CH tools tend to be weak and risky."
  ],
  "weaknesses": [
    "Can't Open Turtles: Struggles versus patient players since he lacks threatening lows from standing, and relies on a very unsafe slide to open defensive players.",
    "Average Defense: Few defensive gimmicks without any standout evasive attacks or reversals. He has to rely on good reads, movement and precise Heat Burst/power crush placement to get out of jams.",
    "Weak Strings and Knowledge Checks: The few strings Shaheen has don't lead to any real mix, and almost all of them can be blocked standing."
  ],
  "links": {
    "official": "https://tekken.com/fighters/shaheen",
    "wavu": "https://wavu.wiki/t/Shaheen",
    "fandom": "https://tekken.fandom.com/wiki/Shaheen",
    "discord": "https://discord.com/invite/AWqNzQ6",
    "youtube movelist": "https://www.youtube.com/watch?v=PpJNy6-vfTA"
  }
}
