{
  "name": "Shaheen",
  "tagline": "Desert Falcon",
  "country": "Saudi Arabia",
  "style": "Close Quarters Combat",
  "description": "Shaheen works for a private military firm and is investigating the mysterious death of his best friend. Utilizing his \"peaceful\" negotiation skills, he learns from an executive of the Middle East G Corp branch that the mastermind is none other than Kazuya Mishima. The wheel of fate must have been turning that day 13 years ago when, on the same day Shaheen lost his family, he saved Salim, a boy around the same age as him, from an assassin. It was the first time he had used the techniques his father had ingrained in him meant to bring down enemies to instead save another's life. Afterwards, Salim told him, \"You should use such skills to become a shield for those in need.\" Then he took Shaheen's hands and welcomed him as his bodyguard. Salim came from the most prominent family in the area, and they did not think twice about taking Shaheen under their wing after he saved their precious son. Salim was bright and full of knowledge, while Shaheen excelled in fighting. The two grew up respecting one another, even as they followed their own paths. Salim became the head of an oil company, and Shaheen, a private military specialist. Yet even if their two paths had diverged, they could still work side by side under the same desire to protect the wealth and pride of others... Or, that's how it should have been. Instead, Shaheen now returns home to deliver news of the confession he'd pried from the G Corp executive regarding Salim's death to his family. The next day, just as Shaheen is about to depart, Salim's younger brother, Zarif, approaches him.  \"I want you to finish what my brother could not,\" Zarif says as he hands Shaheen a sword. It's his brother's treasured blade, one that Salim had carried with him wherever he went. Shaheen draws the keepsake from its sheath. Looking into its polished surface, he makes a vow to never forgive G Corp's tyranny"
}
