{
  "name": "Victor Chevalier",
  "tagline": "Refined Violence",
  "country": "France",
  "style": "Super Spy CQB",
  "description": [
    "Victor is a flashy and versatile all-rounder, with easy execution. He can express any playstyle, with solid pokes, counterhit tools, pressure moves, stance mixups and panic moves.",
    "Most of his tools are weapon-based, making them unparryable, while also granting him great range on his attacks. He has a notably strong while running move (f,f,F+2), which has great range, is plus on block, deals heavy damage on hit, and is a counterhit launcher. He has one of the rare few high, powercrush Heat Engagers in the game, making it difficult to pressure him. In Heat, he gets access to buffed versions of some existing moves that serve to deal heavy chip damage to his opponent.",
    "While having the tools to play in many different ways, Victor doesn't have the best in class of any of them. This puts the onus on the player to rapidly adapt playstyles to gain an advantage. The tools themselves are also fairly committal; whiffing them leaves Victor open to heavy whiff punishment."
  ],
  "strengths": [
    "Fantastic high damage counterhit moves (db+4, 1+2, d+4, b+1+2 etc)",
    "Great evasive moves like u+1+2 and db+3",
    "Simple and effective gameplan",
    "Has a safe, fast power crush move in b+1+2",
    "The general theme of his movelist is not parryable because of weapon attacks and knee attacks"
  ],
  "weaknesses": [
    "Weak tracking overall",
    "Iai stance suffers against jabs",
    "No power lows outside of Heat or stance.",
    "Is very punishable on key moves; has many high moves that are exploitable with no mid alternative",
    "Very feast or famine character"
  ],
  "links": {
    "official": "https://tekken.com/fighters/victor-chevalier",
    "wavu": "https://wavu.wiki/t/Victor",
    "fandom": "https://tekken.fandom.com/wiki/Victor_Chevalier",
    "discord": "https://discord.com/invite/BfGHDB4eQC",
    "youtube movelist": "https://www.youtube.com/watch?v=FKd7NMXxXCo"
  }
}
