{
  "name": "Jack-8",
  "tagline": "High Tech Annihilator",
  "country": "Unknown",
  "style": "Brute Force",
  "description": [
    "Jack-8 is arguably Tekken's most potent character in the midrange. Through strong pokes, incredible range on lows and launchers, and great whiff punish options, Jack allows you to dominate the neutral game and force your opponent to take risks to come to you.",
    "His clunky sidestep and lack of a safe i10 jab make his defense difficult to master, but his solid backdash and new Gamma Howl stance (which power crushes if done raw) give him some options to bail him out of rough spots.",
    "With strong mixup options from Gamma Howl/Charge, a new tracking df+4 mid check, a monster pressure tool in wr1+2 and a plethora of other new tools, Jack-8's new coat of paint makes this robot now truly feel like a truck-sized threat."
  ],
  "strengths": [
    "Neutral Stop Signs: B2, df1, and b3 are all extremely effective ways to stop opponents from approaching in neutral, all of which are safe. Jack also has riskier options like df2, bd2, and f2 that lead to huge damage if they land.",
    "Excellent Pressure: B2 and Jackhammer combine to give Jack scary plus frames, and many of Jack's pressure moves can transition into Gamma Howl for either stopping mashes or forcing a mixup.",
    "Easy Bake Mixups: Gamma Howl gives Jack several highly rewarding mixup options, including several plus on block highs, a tracking mid, a high throw, and even a mid throw. Outside of Gamma Howl, Jack has a complete throw game and several devastating power mids to play around with.",
    "Absurd, Easy Damage: Jack's combo structure and general gameplan are very easy to understand, and his launchers all lead to incredible damage. His basic combos work off of almost all of his major hits.",
    "Heat Smash: Jack has the fastest Heat Smash in the game at i10, making it a very powerful block/whiff punisher. It also has good range and chip on block."
  ],
  "weaknesses": [
    "Bad Counterhits: Jack doesn't have many counterhit tools and is mostly reliant on abusing plus frames and Jackhammer to set up for further pressure.",
    "Huge and Slow: Jack lacks an i10 jab from both standing and crouch, making it difficult to press when he's being pressured. He also has a bad sidestep which makes it hard for him to evade attacks at close ranges.",
    "Mediocre Lows: Jack's low pokes give middling reward, and his bigger lows are slow and/or launch punishable."
  ],
  "links": {
    "official": "https://tekken.com/fighters/jack-8",
    "wavu": "https://wavu.wiki/t/Jack-8",
    "fandom": "https://tekken.fandom.com/wiki/Jack",
    "discord": "https://discord.gg/Pg7XgsT",
    "youtube movelist": "https://www.youtube.com/watch?v=Go42pSvGumc"
  }
}
