{
  "name": "Lidia Sobieska",
  "tagline": "The Warrior Prime Minister",
  "country": "Poland",
  "style": "Traditional Karate",
  "description": [
    "Lidia Sobieska is not only a world-class karate champion, but also one of the political world's most passionate foodies. This has garnered her popularity from the people of Poland, leading her to be known as the \"Warrior Prime Minister.\"",
    "Lidia lost her father when she was a small girl after he was killed in a terrorist attack targeting her grandfather, the Prime Minister of Poland at the time. Caught in the explosion, she suffered injury herself, resulting in the scar over her left eye.",
    "Since that fateful day, she has refused to bend a knee to unjust power, and has been especially critical of the Mishima Zaibatsu and G Corp. Her brave political stance has earned her the trust of people around the world. However, as one of the leaders of a rapidly changing world, Lidia is painfully aware that good intentions alone are not suffice to protect innocent lives.",
    "She believes that the people need a symbol of power that embodies justice, but rallying a force capable of opposing the Mishima Zaibatsu and G Corp is no easy task.",
    "To help her gather intelligence on her opposition inconspicuously, she forms alliances with secret underground organizations such as the Manji Clan, led by Yoshimitsu.",
    "Among the vast supply of information brought to her, one document in particular catches her attention. It appears that her old acquaintance and family friend, Eddy Gordo, acts as a commanding officer for the Tekken Force. The Eddy of Lidia's past was hardworking and loyal to a fault—something must have happened to make him collaborate with the Tekken Force. So, with the help of Yoshimitsu, Lidia saves Eddy from imminent annihilation.",
    "Reunited for the first time in ten years, Lidia learns of the sins Eddy has committed while they were apart. Rather than condemn him, she understands that his hand was forced and instead offers him a beacon of hope.",
    "\"No, we cannot cast aside even those whose hands have been stained by unjust power. Instead, we must act as torches of hope to light the night—to lead them back to the path of righteousness and pave the way to a peaceful world.\"",
    "So, Eddy and Lidia come together to form a new, ragtag unit of fighters made up of Tekken Force soldiers who could be convinced to change their ways. At the same time, however, a certain entity has been accelerating the spread of chaos and destruction. Having won the war against the Mishima Zaibatsu, G Corp has kicked its armed invasion of other countries into high gear.",
    "In response, Lidia quickly takes the lead of public opinion and convinces an international congress to adopt sanctions against G Corp, all while expediting the creation of battle strategies and expansion of troops in preparation for an inevitable showdown.,"
  ]
}
