{
  "name": "Lidia Sobieska",
  "tagline": "The Warrior Prime Minister",
  "country": "Poland",
  "style": "Traditional Karate",
  "description": [
    "Lidia is a defensive, stance-based character designed around controlling her opponent to setup her stance mixups. Defensively, she boasts strong punishment and space control, with far-reaching moves that discourage reckless approach. On offense, she sets a blistering pace of rapid pokes and strings that lead into stances. Her stances have limited but well-defined options to handle any situation, and optionally lead into a third stance for better mixups.",
    "Heat opens up a sizeable addition to Lidia's gameplan. In Heat, she gains access to a unique stance called Heaven and Earth, that sets up a terrifying mixup between an unblockable high and a devastating, safe mid. Entering this stance also increases Lidia's Heaven and Earth level, a unique mechanic that powers up some of Lidia's moves with each level, and carries over to subsequent rounds, making managing it an important part of playing her.",
    "Lidia is a deep and well-rounded character that offers a lot for players at all levels. Her stances offer easy ways for newcomers to setup basic mixups, while specialists can spend time mastering her many just frames for higher damage. Implementing her defensive gameplan requires getting around her linearity, and overrelying on her offense can quickly backfire due to its high risk-reward."
  ],
  "strengths": [
    "Politically Punishing. Having punishers for almost every frame advantage and situation, Lidia rewards precisely punishing the opposition's poor preference for improperly placed pokes.",
    "Tenacious Tactics. Stance situations are quickly and easily enforced and can't be escaped.",
    "Runaway Freight Train. Can win rounds clean in under 10 seconds, even against strong defense.",
    "Blue Spark Queen. Has the highest number of blue spark inputs in the game.",
    "Reversal Toolbox. With a strong powercrush and two varieties of parry, Lidia has many options to struggle out of sticky situations."
  ],
  "weaknesses": [
    "High Commitment. Her best mixup options are all launchable on a wrong guess. Stance transitions are not optional.",
    "Slow Starter. Needs to build up HAE stacks to truly take off. Losing early rounds without getting any stacks makes it difficult to mount a comeback.",
    "One-Track Mind. The good moves are good. Your opponents' round and fleshy bodies may start looking a lot like nails for your f,F+2's hammer.",
    "Low Reward CHs. Her counter hit options mostly give a single free hit. The best counter hit launchers are either unsafe or heavily scaled."
  ],
  "links": {
    "official": "https://tekken.com/fighters/lidia",
    "wavu": "https://wavu.wiki/t/Lidia",
    "fandom": "https://tekken.fandom.com/wiki/Lidia_Sobieska",
    "discord": "https://discord.com/invite/ZyHmEFV",
    "youtube movelist": "https://www.youtube.com/watch?v=tqsGOCjIEII"
  }
}
